# yolov5n.yaml

# Model Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.25 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv5 v6.0 head (with attention)
head:
  - [-1, 1, Conv, [512, 1, 1]]  # Adjust this layer
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # P4
  - [[-1, 6], 1, Concat, [1]]  # concat P4

  - [-1, 3, C3, [512, False]]  # 13

  - [-1, 1, Conv, [256, 1, 1]]  # Adjust this layer
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # P3
  - [[-1, 4], 1, Concat, [1]]  # concat P3
  - [-1, 3, C3, [256, False]]  # 17

  - [-1, 1, Conv, [256, 3, 2]]  # Adjust this layer
  - [[-1, 14], 1, Concat, [1]]  # concat P4
  - [-1, 3, C3, [512, False]]  # 20

  - [-1, 1, Conv, [512, 3, 2]]  # Adjust this layer
  - [[-1, 10], 1, Concat, [1]]  # concat P5
  - [-1, 3, C3, [1024, False]]  # 23

  # Detection head with attention flag, attention parameter passed
  - [[17, 20, 23], 1, Detect, [nc, anchors, attention=True]]  # Set attention flag here